{
	"title": "Army's Heaven",
	"videos": [
		{
			"title": "Video Update",
			"link": "https://www.youtube.com/embed/_yTgHGTRmaQ?si=Z2dH63Ie9P14aiqH"
		},
		{
			"title": "Video Demonstration",
			"link": "https://www.youtube.com/embed/iTvzLS9thS4?si=4Z06WivlpkVzaneD"
		}
	],
	"images": [
		"1.png",
		"2.png",
		"3.png",
		"4.png",
		"5.png",
		"6.png",
		"7.png"
	],
	"description": [
		{
			"type": "paragraph",
			"text": "<span class='text-color-green'>Army’s Heaven</span> is a first-person shooter project featuring both single-player and multiplayer modes. Initially developed with <span class='text-color-green'>PUN2 (Photon Unity Package)</span> for online gameplay, the project has since expanded to include a robust single-player campaign framework designed to demonstrate modular gameplay systems and scalable architecture."
		},
		{
			"type": "paragraph",
			"text": "Recent development efforts have focused on building a high-quality single-player experience that lays the groundwork for enhanced multiplayer functionality. The project features a custom-built <span class='text-color-green'>FPS controller</span>, an animation-driven <span class='text-color-green'>shooting system</span>, and a state-driven <span class='text-color-green'>AI architecture</span>."
		},
		{
			"type": "paragraph",
			"text": "<strong>Key Systems Developed:</strong>"
		},
		{
			"type": "list",
			"items": [
				"<span class='text-color-green'>Custom FPS Controller</span> — Built from the ground up for responsive movement, fluid aiming, and modular input handling.",
				"<span class='text-color-green'>AI Behavior System</span> — Finite state machine–driven enemy agents with support for path finding, perception, combat states, and dynamic reactions to the player.",
				"<span class='text-color-green'>Ragdoll Reanimation</span> — A ragdoll-to-animation blending system that allows NPCs to seamlessly stand up after being knocked down, preserving bone pose and orientation.",
				"<span class='text-color-green'>Damage-Based Animation Layering</span> — AI character animations adapt dynamically based on damaged body parts (e.g. limping when legs are injured), leveraging Unity’s animation system.",
				"<span class='text-color-green'>Inventory and Item System</span> — ScriptableObject-based inventory architecture supporting pickups, weapon management, and UI feedback.",
				"<span class='text-color-green'>Editor Tooling</span> — A custom inspector tool for visualizing and editing AI patrol waypoints directly in the Unity Editor, improving iteration speed and level design workflow."
			]
		},
		{
			"type": "paragraph",
			"text": "The ultimate goal is to merge these refined single-player systems back into the multiplayer version, ensuring both modes benefit from the same polished mechanics."
		}
	],
	"technologies": [
		"C_Sharp",
		"Unity",
		"Photon"
	],
	"links": [
		{
			"buttonText": "GitHub",
			"buttonLink": "https://github.com/Adamska-01/Online_FPS"
		},
		{
			"buttonText": "Itch.io",
			"buttonLink": "https://salvg.itch.io/armys-heaven"
		}
	]
}